Delans-TLE/src/Documents/ES_Выдача/ES_Выдача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ES_Выдача</name>
  <comment>Документ выдачи заказа курьеру</comment>
  <basedOn>Document.ES_ПланДоставки</basedOn>
  <registerRecords>InformationRegister.ES_СтатусыЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыУКурьера</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыНаСкладе</registerRecords>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ES_ПланДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВхНакладная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяДобавленияЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиВЗаказе</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатурыЗапас</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НППлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбьявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Опасность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/AccumulationRegisters/ES_ЗаказыНаСкладе/ES_ЗаказыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ES_ЗаказыНаСкладе</name>
  <comment>Принятые заказы на склад</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Delans-TLE/src/AccumulationRegisters/ES_ЗаказыУКурьера/ES_ЗаказыУКурьера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ES_ЗаказыУКурьера</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Delans-TLE/src/InformationRegisters/ES_СвязьПлановИОтчетов/ES_СвязьПлановИОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_СвязьПлановИОтчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОтчетОДоставке</name>
    <type>
      <types>DocumentRef.ES_ОтчетОДоставке</types>
    </type>
  </resources>
  <resources>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>РасходИзОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПланДоставки</name>
    <type>
      <types>DocumentRef.ES_ПланДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/ES_СтатусыЗаказов/ES_СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_СтатусыЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.ES_СтатусыЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Удалить_ДатаПоследнегоПроведения</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Enums/ES_ВидыДоставки/ES_ВидыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_ВидыДоставки</name>
  <enumValues>
    <name>СкладДвери</name>
  </enumValues>
  <enumValues>
    <name>СкладСклад</name>
  </enumValues>
  <enumValues>
    <name>ДвериДвери</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/Enums/ES_СтатусыЗаказов/ES_СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_СтатусыЗаказов</name>
  <enumValues>
    <name>ТребуетсяЗабор</name>
  </enumValues>
  <enumValues>
    <name>Комплектуется</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетГруз</name>
  </enumValues>
  <enumValues>
    <name>Назначен</name>
    <comment>Заказ в проведенном плане доставки</comment>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
    <comment>Заказ принят к исполнению</comment>
  </enumValues>
  <enumValues>
    <name>НеДоставлен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноДоставленРассчитать</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноДоставлен</name>
  </enumValues>
  <enumValues>
    <name>ДоставленВозвращен</name>
  </enumValues>
  <enumValues>
    <name>ДоставленРассчитать</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетВыдачи</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенРассчитать</name>
  </enumValues>
  <enumValues>
    <name>НазначенПринят</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленПринят</name>
  </enumValues>
  <enumValues>
    <name>Некондиция</name>
  </enumValues>
  <enumValues>
    <name>БезСтатуса</name>
  </enumValues>
  <enumValues>
    <name>МеждуСкладами</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетГрузНазначен</name>
  </enumValues>
  <enumValues>
    <name>ОтмененПринят</name>
  </enumValues>
  <enumValues>
    <name>НеправильныйАдрес</name>
  </enumValues>
  <enumValues>
    <name>ПолучательПереехал</name>
  </enumValues>
  <enumValues>
    <name>ОфисПолучателяЗакрыт</name>
  </enumValues>
  <enumValues>
    <name>ПолучателяНетДомаВОфисе</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/Documents/ES_Выдача/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ES_ЗаказыНаСкладе.Записывать = Истина;
	Движения.ES_ЗаказыУКурьера.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ES_ВыдачаЗаказы.Заказ,
		|	ES_ВыдачаЗаказы.ДатаВремяДобавленияЗаказа
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ES_Выдача.Заказы КАК ES_ВыдачаЗаказы
		|ГДЕ
		|	ES_ВыдачаЗаказы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказы.Заказ,
		|	ВТ_Заказы.ДатаВремяДобавленияЗаказа,
		|	isnull(ES_ЗаказыНаСкладеОстатки.КоличествоОстаток,0) КАК ОстатокНаСкладе,
		|	isnull(ES_ЗаказыУКурьераОстатки.КоличествоОстаток,0) КАК ОстатокУКурьера
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ES_ЗаказыНаСкладе.Остатки(
		|				&МоментВремени,
		|				Заказ В
		|						(ВЫБРАТЬ
		|							ВТ_Заказы.Заказ
		|						ИЗ
		|							ВТ_Заказы КАК ВТ_Заказы)
		|					И Склад = &Склад) КАК ES_ЗаказыНаСкладеОстатки
		|		ПО ВТ_Заказы.Заказ = ES_ЗаказыНаСкладеОстатки.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ES_ЗаказыУКурьера.Остатки(
		|				&МоментВремени,
		|				Заказ В
		|					(ВЫБРАТЬ
		|						ВТ_Заказы.Заказ
		|					ИЗ
		|						ВТ_Заказы КАК ВТ_Заказы)) КАК ES_ЗаказыУКурьераОстатки
		|		ПО ВТ_Заказы.Заказ = ES_ЗаказыУКурьераОстатки.Заказ";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Движение (расход) в РН ES_ЗаказыНаСкладе
		Если Выборка.ОстатокНаСкладе > 0 Тогда
			Движение = Движения.ES_ЗаказыНаСкладе.ДобавитьРасход();
			Движение.Заказ = Выборка.Заказ;
			Движение.Период = Выборка.ДатаВремяДобавленияЗаказа;
			Движение.Склад = Склад;
			Движение.Количество = 1;	
		Иначе
			ВызватьИсключение НСтр("ru = 'Заказ " + Выборка.Заказ +" отсутствует на складе " + Склад +"'");	
			Отказ = Истина;
		КонецЕсли;
		
		//Движение (приход) в РН ES_ЗаказыУКурьера
		Если Выборка.ОстатокУКурьера = 0 Тогда
			Движение = Движения.ES_ЗаказыУКурьера.ДобавитьПриход();
			Движение.Заказ = Выборка.Заказ;
			Движение.Период = Выборка.ДатаВремяДобавленияЗаказа;
			Движение.Курьер = Курьер;
			Движение.Количество = 1;
		Иначе 
			ВызватьИсключение НСтр("ru = 'Заказ " + Выборка.Заказ +" уже выдан курьеру " + Выборка.Курьер +"'");	
			Отказ = Истина;
		КонецЕсли;
				
	КонецЦикла;
	
	ДобавитьЗаписьВРССтатусыЗаказов(Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДокументОснование = ДанныеЗаполнения;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ES_ПланДоставки") Тогда
		
		Если ДанныеЗаполнения.Подтвержден = Ложь Тогда
			ВызватьИсключение НСтр("ru = 'Выдачу можно создать только на основании утвержденного плана'");
			Возврат;			
		КонецЕсли;
		
		ЕстьОтчет = ПолучитьОтчетПоПлану(ДанныеЗаполнения);
		Если ЕстьОтчет = Истина Тогда
			ВызватьИсключение НСтр("ru = 'На основании плана уже создан отчет. Выдачу произвести невозможно'");
			Возврат;			
		КонецЕсли;
				
		Курьер = ДанныеЗаполнения.Курьер;
		Склад = ДанныеЗаполнения.Склад;
		Для каждого Стр Из ДанныеЗаполнения.Заказы Цикл
			Если ТипЗнч(Стр.ДокументДоставки) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Если Стр.ДокументДоставки.ES_ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери Тогда
				НоваяСтрокаЗаказы = Заказы.Добавить();
				НоваяСтрокаЗаказы.Заказ = Стр.ДокументДоставки;
				НоваяСтрокаЗаказы.Заказчик = Стр.Заказчик;
				НоваяСтрокаЗаказы.ВхНакладная = Стр.ДокументДоставки.ES_ВхНакладная;
				НоваяСтрокаЗаказы.НомерНакладной	=	Стр.НомерНакладной;
				НоваяСтрокаЗаказы.ДатаВремяДобавленияЗаказа = ТекущаяДата();
				
				СтрокиСТоварами = ДанныеЗаполнения.Грузы.НайтиСтроки(Новый Структура("Заказ",Стр.ДокументДоставки));
				Если СтрокиСТоварами.Количество () > 0 Тогда
					Для каждого Стр ИЗ СтрокиСТоварами Цикл
						НоваяСтрокаГрузы = Грузы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаГрузы,Стр);
						НоваяСтрокаГрузы.Заказ = Стр.Заказ;
					КонецЦикла;
				КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//Для каждого Стр Из ДанныеЗаполнения.Грузы Цикл
		//	Если ТипЗнч(Стр.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//		Если Стр.Заказ.ES_ВидДоставки = Перечисления.ES_ВидыДоставки.СкладДвери Тогда
		//			НоваяСтрокаГрузы = Грузы.Добавить();
		//			ЗаполнитьЗначенияСвойств(НоваяСтрокаГрузы,Стр);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьОтчетПоПлану(ПланДоставки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ES_СвязьПлановИОтчетовСрезПоследних.ОтчетОДоставке
	|ИЗ
	|	РегистрСведений.ES_СвязьПлановИОтчетов.СрезПоследних(, ПланДоставки = &ПланДоставки) КАК ES_СвязьПлановИОтчетовСрезПоследних";
	
	Запрос.УстановитьПараметр("ПланДоставки", ПланДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ПолучитьОтчетПоПлану()

Процедура ДобавитьЗаписьВРССтатусыЗаказов(Отказ)
	
	ТекстЗапроса = "";
	МассивЗаказов = Новый Массив;
	Запрос = Новый Запрос;
	Движения.ES_СтатусыЗаказов.Записывать = Истина;
	Для каждого Стр Из Заказы Цикл
	
		ТекстЗапроса = ТекстЗапроса+ Символы.ПС + 
		"ВЫБРАТЬ
		|	ES_СтатусыЗаказовСрезПоследних.Заказ,
		|	ES_СтатусыЗаказовСрезПоследних.СтатусЗаказа,
		|	&Дата"+Стр.НомерСтроки+" КАК ДатаПроведения
		|ИЗ
		|	РегистрСведений.ES_СтатусыЗаказов.СрезПоследних(&Дата"+Стр.НомерСтроки+", Заказ = &Заказ"+Стр.НомерСтроки+") КАК ES_СтатусыЗаказовСрезПоследних;
		|///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////";
		Запрос.УстановитьПараметр("Дата"+Стр.НомерСтроки,Стр.ДатаВремяДобавленияЗаказа);
		Запрос.УстановитьПараметр("Заказ"+Стр.НомерСтроки,Стр.Заказ);
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	
	Для й = 0 По МассивРезультатов.Количество()-1 Цикл
		
		Выборка = МассивРезультатов[й].Выбрать();
		Выборка.Следующий();
		
		Если Выборка.СтатусЗаказа = Перечисления.ES_СтатусыЗаказов.НазначенПринят  Тогда
			СтатусЗаказаДляПроведения = Выборка.СтатусЗаказа;
		Иначе
			Отказ = Истина;
			Сообщить("" + Выборка.Заказ + ", статус: " + Выборка.СтатусЗаказа + ". Приемку провести нельзя");
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ES_СтатусыЗаказов.Добавить();
		Движение.Период						= Выборка.ДатаПроведения;
		Движение.Заказ 						= Выборка.Заказ;
		Движение.СтатусЗаказа 				= СтатусЗаказаДляПроведения;
		Движение.Ответственный 				= Ответственный;
		
		
	КонецЦикла;
		
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ПометкаУдаления ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		// Нельзя пометить на удаление и отменить проведение документа, если он проходит по другим документам
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Ссылка);
		
		УстановитьПривилегированныйРежим(Истина);
		ТабНайденныхСсылок = НайтиПоСсылкам(МассивСсылок);
		УстановитьПривилегированныйРежим(Ложь);
		
		Для каждого Строка Из ТабНайденныхСсылок Цикл
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Строка.Данные)) Тогда
				//ЭР Несторук С.И. 13.10.2017 14:44:41 {
				//Смотрим ссылаются ли на документ проведенные документы, а не помеченные на удаление
				//Если НЕ Строка.Данные.ПометкаУдаления и НЕ Ссылка = Строка.Данные Тогда
				Если Строка.Данные.Проведен и НЕ Ссылка = Строка.Данные Тогда
					//}ЭР Несторук С.И.
					Сообщить("На документ ссылается " + Строка.Данные);
					Отказ = Истина;
					Возврат;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 

КонецПроцедуры
